{
  "status": "success",
  "totalResults": 14101,
  "results": [
    {
      "title": "Type 2 diabetes is associated with hospital stays for a wide range of medical conditions but, in people diagnosed at a young age, mental health disorders are the biggest contributing factor",
      "link": "http://www.newswise.com/articles/view/796536/?sc=rsla",
      "keywords": null,
      "creator": ["PLOS"],
      "video_url": null,
      "description": null,
      "content": "Type 2 diabetes is associated with hospital stays for a wide range of medical conditions but, in people diagnosed at a young age, mental health disorders are the biggest contributing factor ##### In your coverage, please use this URL to provide access to the freely available paper in PLOS Medicine : http://journals.plos.org/plosmedicine/article?id=10.1371/journal.pmed.1004261 Press-only preview: https://plos.io/3Y1Eyx3 Image Caption: Researchers find that Type 2 diabetes is associated with hospital stays for a wide range of medical conditions but, in people diagnosed at a young age, mental health disorders are the biggest contributing factor. Image Credit: Hongjiang Wu (CC-BY 4.0, https://creativecommons.org/licenses/by/4.0/ ) Image URL: https://plos.io/3PDNCpI Article Title: Age- and sex-specific hospital bed-day rates in people with and without type 2 diabetes: A territory-wide population-based cohort study of 1.5 million people in Hong Kong Author Countries : China Funding: The author(s) received no specific funding for this work. Competing Interests: see manuscript",
      "pubDate": "2023-08-04 18:57:28",
      "image_url": null,
      "source_id": "newswise",
      "category": ["top"],
      "country": ["united states of america"],
      "language": "english"
    },
    {
      "title": "Lawmakers tour site of Parkland school massacre before experts recreate shooting inside",
      "link": "https://www.dailypress.com/2023/08/04/lawmakers-tour-site-of-parkland-school-massacre-before-experts-recreate-shooting-inside/",
      "keywords": ["Uncategorized"],
      "creator": ["Associated Press"],
      "video_url": null,
      "description": "Nine members of Congress have toured the blood-stained and bullet-pocked halls where the 2018 Parkland, Florida, school massacre happened. The six Democrats and three Republicans visited Marjory Stoneman Douglas High School's old freshman building, the scene of the shooting that killed 17. It has remained locked behind a chain-link fence for use in last year's trial of shooter Nikolas Cruz. The visit lasted nearly two hours. After Friday's tour, a shooting reenactment will be staged as part of a lawsuit filed by the victims' families against former Deputy Scot Peterson and the Broward Sheriff's Office. Live bullets will be fired into a safety device and the sounds will be recorded.",
      "content": "By TERRY SPENCER and FREIDA FRISARO (Associated Press) PARKLAND, Fla. (AP) — Nine members of Congress toured the blood-stained and bullet-pocked halls at Marjory Stoneman Douglas High School on Friday, shortly before ballistics technicians reenact the massacre that left 14 students and three staff members dead. Few have been inside the three-story building since the Valentine’s Day 2018 shooting. The structure looms over the campus, locked behind a chain-link fence for use as evidence in last year’s penalty trial for the shooter. There is broken glass on the floor, along with wilted roses, deflated balloons and discarded gifts. Opened textbooks and laptop computers remain on students’ desks — at least those that weren’t toppled during the chaos. In one classroom, there is an unfinished chess game one of the slain students had been playing, the pieces unmoved. The Associated Press was one of five media outlets allowed to tour the building after shooter Nikolas Cruz’s jury went through. The House members spent an hour and 40 minutes walking the same path he did during the six-minute attack, accompanied by victims’ family members and prosecutors. After the tour, the members — six Democrats and three Republicans on the House School Safety and Security Caucus — traveled to a nearby hotel to discuss school safety issues with parents and wives who lost loved ones in the attack. The roundtable meeting was being held in the same ballroom where the families learned of their loved ones’ deaths. Florida Democratic Rep. Jared Moskowitz, a Stoneman Douglas graduate whose district includes Parkland, said Congress owes it to the families who have lost children, parents and spouses in school shootings to make campuses safer. He said seeing the scene will allow the members to fully grasp what happened. “You can read about it all day long, and debate it all day long, but it is not the same as walking through the school,” said Moskowitz, who organized the tour with Republican Rep. Mario Diaz-Balart of Miami. Moskowitz pointed out that Parkland, an upscale suburb of Fort Lauderdale, is considered Florida’s safest city. “It is now the home of the largest (high) school shooting in our history,” he said. Parent Max Schachter, whose 14-year-old son Alex died in the shooting, suggested the tour and school safety conference to Moskowitz. “We can come together and enact common-sense school safety solutions so this will never happen again,” said Schachter, a former insurance broker who is now a full-time campus safety advocate. “Safety has to come before education — you cannot teach dead kids.” The building is scheduled to be demolished after the tour and shooting reenactment. The school is closed for the summer and no students or teachers were on campus Friday. The shooting, which sparked a nationwide movement for gun control, traumatized the South Florida community. Cruz, a 24-year-old former Stoneman Douglas student, pleaded guilty in 2021 and was sentenced to life in prison. Not long after the lawmakers left the school, crews began setting up for the reenactment, which will begin later Friday. Bags, tables and ladders were carted inside. Several people went inside a hallway with someone with a camera as two loud helicopters hovered overhead. Ballistics experts will fire up to 139 shots of live ammunition during the reenactment. The experts will fire from the same spots as Cruz, with an identical AR-15-style semiautomatic rifle, and the bullets will be caught by a safety device. The reenactment is expected to take several hours. Technicians outside the building will record the sound of the gunfire, seeking to capture what the Broward County deputy assigned to the school, Scot Peterson, heard during the attack. The reenactment is part of a lawsuit by the victims’ families and the wounded that accuses Peterson of failing in his duty to protect them and their loved ones. Peterson, who worked for the Broward County Sheriff’s Office and is named in the lawsuit, said he didn’t hear all the shots and could not pinpoint their origin because of echoes. He got within feet of the building’s door and drew his gun, but backed away and stood next to an adjoining building for 40 minutes, making radio calls. He has said he would have charged into the building if he had known the shooter’s location. Families of the victims who filed the lawsuit contend Peterson knew Cruz’s location, but retreated out of cowardice and in violation of his duty to protect their loved ones. Peterson, 60, was acquitted in June of felony child neglect and other criminal charges for failing to act, the first U.S. trial of a law enforcement officer for conduct during an on-campus shooting. The burden of proof is lower in the civil lawsuit. Circuit Judge Carol-Lisa Phillips allowed the reenactment, but made clear she was not ruling on whether the recording will be played at trial. That will have to be argued later, she said. It is likely Peterson’s attorneys will oppose the attempt. No trial date has been set. The families and wounded are seeking unspecified damages. Sign up for email newsletters",
      "pubDate": "2023-08-04 18:37:47",
      "image_url": null,
      "source_id": "dailypress",
      "category": ["top"],
      "country": ["united states of america"],
      "language": "english"
    },
    {
      "title": "Hackaday Prize 2023: One-Handed Soldering with the Solder Sustainer",
      "link": "https://hackaday.com/2023/08/04/hackaday-prize-2023-one-handed-soldering-with-the-solder-sustainer/",
      "keywords": [
        "contests",
        "The Hackaday Prize",
        "2023 Hackaday Prize",
        "extruder",
        "feeder",
        "one handed",
        "solder",
        "soldering"
      ],
      "creator": ["Dan Maloney"],
      "video_url": null,
      "description": "For a lot of us, soldering has become so ingrained that it’s muscle memory. We know exactly when the iron is hot enough, how long to leave the tip in …read more",
      "content": "For a lot of us, soldering has become so ingrained that it’s muscle memory. We know exactly when the iron is hot enough, how long to leave the tip in contact with the joint to heat it up, and exactly where to dab in the solder to get it to flow. When you’re well-practiced it can be a beautiful thing, but for those who don’t do it frequently, soldering can be frustrating indeed. looks like it just might be aimed at solving that problem, as well as a few others. It comes to us from [RoboticWorx], and while it looks a little like the love child of a MIG welder and a tattoo machine, it’s got a lot going for it. The idea is to make soldering a one-handed task by combining the soldering iron and a solder wire feeder into one compact package. The solder feeder is very reminiscent of a filament extruder on a 3D printer, using a stepper to drive spring-loaded pinch wheels, which forces the solder down a curved 3D-printed tube that directs it toward the tip. The pancake stepper is driven by an ESP32, which also supports the touch sensor that lets you advance the solder. The whole thing can be powered off a USB-C power supply, or using the onboard USB charger that can be connected in line with the soldering iron supply. The video below shows Solder Sustainer in use. Yes, we know — some of those joints look a little iffy. But that seems to have more to do with technique than with the automatic solder feed. And really, in situations where you’ve previously wished for a third hand while soldering, this would probably be just the thing. The Solder Sustainer is an entry in . If you’ve got an idea for a tool, jig, fixture, or instrument that makes hacking easier, we want to know about it. But you’d better hurry — the round ends on August 8.",
      "pubDate": "2023-08-04 18:30:56",
      "image_url": "https://hackaday.com/wp-content/uploads/2023/08/solder_sustainer.png",
      "source_id": "hackaday",
      "category": ["top"],
      "country": ["united states of america"],
      "language": "english"
    }
  ],
  "nextPage": "16911727997c69e6417660d9f6b8fe197003306554"
}
